# config.py

# تنظیمات اتصال
GEMINI_API_KEY = "*****"
MODEL_NAME = "gemini-2.5-flash"

# تنظیمات ووکامرس (این‌ها را بعدا پر می‌کنیم)
WOO_URL = "https://vahidibike.ir"
WOO_CK = "****"
WOO_CS = "****"

# اطلاعات وردپرس برای آپلود عکس
WP_USERNAME = "pyapi"  # یوزرنیم ادمین وردپرس
WP_APP_PASSWORD = "mOLF rgQ3 Bm3q jX2c elea FXvW"  # رمز اپلیکیشن

# لیست‌های ثابت برای جلوگیری از خطا
ALLOWED_COLORS = ["مشکی", "سفید", "قرمز", "آبی", "زرد", "سبز", "نارنجی", "صورتی", "بنفش", "خاکستری", "قهوه‌ای", "نقره‌ای"]

SIZE_TO_SLUG = {
    "12": "12s", "16": "16s", "20": "20s", "24": "24s",
    "26": "26s", "27.5": "27-5", "29": "29s"

}
